#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Quoted references are deprecated

  on modules/vpn/gcp.tf line 22, in resource "google_compute_ha_vpn_gateway" "target_gateway":
  22:   provider = "google-beta.vpn"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 5 more similar warnings elsewhere)

Success! The configuration is valid, but there were some validation warnings as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.networking.google_compute_network.multi_cloud_gcp: Refreshing state... [id=projects/rytswd-get-multi-cloud-k8s-v01/global/networks/multi-cloud-gcp]
module.networking.google_compute_subnetwork.multi_cloud_gcp_subnet: Refreshing state... [id=projects/rytswd-get-multi-cloud-k8s-v01/regions/europe-west2/subnetworks/multi-cloud-gcp-subnet]
module.networking.data.aws_availability_zones.available: Refreshing state...
module.networking.aws_vpc.multi_cloud_aws: Refreshing state... [id=vpc-0a450e3e7331f4ea8]
module.networking.aws_subnet.multi_cloud_aws[1]: Refreshing state... [id=subnet-02834aac3c4ac7af5]
module.networking.aws_subnet.multi_cloud_aws[2]: Refreshing state... [id=subnet-05d5da8e72808b377]
module.networking.aws_subnet.multi_cloud_aws[0]: Refreshing state... [id=subnet-036f32ffa1be78f72]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpn.aws_customer_gateway.customer_gateway_1 will be created
  + resource "aws_customer_gateway" "customer_gateway_1" {
      + arn        = (known after apply)
      + bgp_asn    = "64567"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_customer_gateway.customer_gateway_2 will be created
  + resource "aws_customer_gateway" "customer_gateway_2" {
      + arn        = (known after apply)
      + bgp_asn    = "64567"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + vpc_id           = "vpc-0a450e3e7331f4ea8"
    }

  # module.vpn.aws_route_table_association.main[0] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-036f32ffa1be78f72"
    }

  # module.vpn.aws_route_table_association.main[1] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-02834aac3c4ac7af5"
    }

  # module.vpn.aws_route_table_association.main[2] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-05d5da8e72808b377"
    }

  # module.vpn.aws_vpn_connection.cx_1 will be created
  + resource "aws_vpn_connection" "cx_1" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = (known after apply)
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = (known after apply)
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_connection.cx_2 will be created
  + resource "aws_vpn_connection" "cx_2" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = (known after apply)
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = (known after apply)
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_gateway.vpn_gateway will be created
  + resource "aws_vpn_gateway" "vpn_gateway" {
      + amazon_side_asn = (known after apply)
      + arn             = (known after apply)
      + id              = (known after apply)
      + vpc_id          = "vpc-0a450e3e7331f4ea8"
    }

  # module.vpn.google_compute_external_vpn_gateway.aws_gateway will be created
  + resource "google_compute_external_vpn_gateway" "aws_gateway" {
      + description     = "VPN gateway on AWS side"
      + id              = (known after apply)
      + name            = "aws-gateway"
      + project         = (known after apply)
      + redundancy_type = "FOUR_IPS_REDUNDANCY"
      + self_link       = (known after apply)

      + interface {
          + id         = 0
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 1
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 2
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 3
          + ip_address = (known after apply)
        }
    }

  # module.vpn.google_compute_ha_vpn_gateway.target_gateway will be created
  + resource "google_compute_ha_vpn_gateway" "target_gateway" {
      + id             = (known after apply)
      + name           = "vpn-to-aws"
      + network        = "https://www.googleapis.com/compute/v1/projects/rytswd-get-multi-cloud-k8s-v01/global/networks/multi-cloud-gcp"
      + project        = (known after apply)
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # module.vpn.google_compute_router.main will be created
  + resource "google_compute_router" "main" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "router-main"
      + network            = "https://www.googleapis.com/compute/v1/projects/rytswd-get-multi-cloud-k8s-v01/global/networks/multi-cloud-gcp"
      + project            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64567
        }
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_1 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_1" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-1"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha1"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_2 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_2" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-2"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha2"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_3 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_3" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-3"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha3"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_4 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_4" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-4"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha4"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_1 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-1"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_2 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_2" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-2"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-2"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_3 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_3" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-3"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-3"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_4 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_4" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-4"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-4"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_1 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_1" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha1"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 0
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_2 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_2" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha2"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 1
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_3 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_3" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha3"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 2
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_4 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_4" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha4"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 3
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on modules/vpn/gcp.tf line 22, in resource "google_compute_ha_vpn_gateway" "target_gateway":
  22:   provider = "google-beta.vpn"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

This plan was saved to: t.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "t.tfplan"

```

</details>

*Pusher: @rytswd, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform for Kubernetes Setup`*